--   Дана таблица:
--   Dates - клиенты
--   (
--   Id bigint,
--   Dt date
--   );
--   1. Написать запрос, который возвращает интервалы для одинаковых Id. Например, есть такой
--   набор данных:
--   Id Dt
--   1 01.01.2021
--   1 10.01.2021
--   1 30.01.2021
--   2 15.01.2021
--   2 30.01.2021
--   Результатом выполнения запроса должен быть такой набор данных:
--   Id Sd Ed
--   1 01.01.2021 10.01.2021
--   1 10.01.2021 30.01.2021
--   2 15.01.2021 30.01.2021

-- 2
SELECT * 
FROM (
	SELECT d.Id, d.dt AS St,
		(SELECT MIN(d2.dt)
		 FROM Dates AS d2
		 WHERE d.Id = d.Id AND d.dt < d2.dt) AS Ed
	FROM Dates d
) as q
WHERE Ed IS NOT NULL
ORDER BY q.Id, St
